{
    "navbar": {
      "feedback": "Donne ton avis",
      "how_it_works": "Comment ça marche"
  },

  "gpxexporter": {
    "route": "Nom du parcours",
    "start_date": "Date et heure de début",
    "average_pace": "Allure moyenne (min/km)",
    "clear_button": "Effacer parcours",
    "download_gpx": "Télécharger",
    "my_trace": "Mon parcours",
    "error_no_points": "Aucun parcours à exporter !",
    "error_invalid_pace": "L'allure est invalide",
    "error_no_track_name": "Le nom du parcours est obligatoire",
    "error_date_exceeds_now": "La fin de la course dépasse l’heure actuelle. Veuillez ajuster la date de début ou l’allure pour générer un fichier valide."
  },
  
  "runstats": {
    "title": "Statistiques de la course",
    "distance": "Distance",
    "duration": "Durée",
    "altitude": "Altitude"
  },

  "map": {
    "search": "Rechercher une adresse"
  },

  "metadata": {
    "title": "TraceGpx – Créez votre parcours de course en un clic",
    "description": "TraceGpx vous permet de dessiner facilement votre parcours de course sur une carte et de télécharger votre fichier GPX pour Strava, Garmin, et plus.",
    "og": {
      "title": "TraceGpx – Dessinez votre parcours de course",
      "description": "Dessinez votre parcours, téléchargez votre fichier GPX et partagez-le facilement.",
      "alt": "Aperçu de l'interface TraceGpx"
    }
  },

  "infobanner": {
    "text": "Note : Ce projet est encore en évolution. Les fonctionnalités futures pourraient inclure des profils d’altitude, le suivi des allures intermédiaires, et plus encore."
  },

  "how-it-works": {
    "title": "Comment fonctionne TraceGPX",
    "generate_gpx_title": "Générez vos traces GPX",
    "generate_gpx_text_1": "TraceGPX vous permet de créer rapidement et facilement des fichiers GPX à partir de vos parcours de course. Ajoutez vos points sur la carte, définissez votre allure et exportez un fichier GPX compatible avec Strava, Garmin ou tout autre appareil GPS.",
    "generate_gpx_text_2": "L’outil calcule en temps réel la distance, le dénivelé et la durée, afin que vous ayez toujours des statistiques précises avant d’exporter votre trace.",
    "import_strava_title": "Importer dans Strava",
    "import_strava_text": "Une fois votre fichier GPX exporté, vous pouvez l’importer dans Strava en quelques étapes simples :",
    "import_step_1": "Ouvrez Strava sur votre ordinateur et allez sur la page de téléchargement.",
    "import_step_2": "Sélectionnez Fichier et choisissez le fichier GPX que vous avez exporté depuis TraceGPX.",
    "import_step_3": "Vérifiez votre parcours et enregistrez-le. Strava affichera la route, la distance et l’allure.",
    "video_unsupported": "Votre navigateur ne supporte pas la balise vidéo.",
    "future_features_title": "Fonctionnalités à venir",
    "future_features_text": "TraceGPX est encore en évolution. Les futures fonctionnalités pourraient inclure :",
    "feature_altitude": "Profils d’altitude",
    "feature_intermediate_pace": "Suivi des allures intermédiaires",
    "feature_splits": "Fiches personnalisables et données de tours",
    "feature_dashboard": "Tableau de statistiques amélioré",
    "why_use_title": "Pourquoi utiliser TraceGPX ?",
    "why_use_text": "Que ce soit pour vos sorties course ou vélo, TraceGPX vous permet de créer et visualiser vos parcours facilement, puis de les exporter vers Strava ou toute autre application GPS. Rapide, intuitif et efficace."
  }


  

}